Revit 2026 API

# ViewDisplayEdges Enumeration

---

A collection of settings defining how visible edges are displayed

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ViewDisplayEdges
```
```vb
Public Enumeration ViewDisplayEdges
```
```cpp
public enum class ViewDisplayEdges
```
```fsharp
type ViewDisplayEdges
```

| Member name | Value | Description |
| --- | --- | --- |
| None | 0 | The edges are invisible |
| Simple | 1 | The edges are visible and drawn according to style |

#### Reference

Autodesk.Revit.DB Namespace